{
  "sidebar": {
    "avatar": "/assets/images/my-avatar.png",
    "name": "Yash Pawar",
    "title": "Software Developer",
    "contacts": [
      {
        "icon": "fa-regular fa-address-card",
        "title": "CV",
        "link": "/assets/pdf/Resume.pdf",
        "text": "Download",
        "download": true
      },
      {
        "icon": "fa-regular fa-envelope",
        "title": "Email",
        "link": "mailto:asyncyash@gmail.com",
        "text": "Work"
      },
      {
        "icon": "fa-solid fa-location-dot",
        "title": "Location",
        "text": "Gujarat, India"
      }
    ],
    "socials": [
      {
        "icon": "fa-brands fa-github",
        "link": "https://github.com/yashpwr"
      },
      {
        "icon": "fa-brands fa-linkedin-in",
        "link": "https://www.linkedin.com/in/yashpwr"
      }
    ]
  },
  "about": {
    "title": "About Me",
    "description": [
      "With over five years of hands-on experience as a Full Stack Developer, I specialize in architecting and building robust, scalable, and high-performance web applications from the ground up. My expertise spans the entire development lifecycle, from initial concept and design to deployment and maintenance. I thrive on solving complex challenges and am deeply committed to writing clean, efficient, and maintainable code.",
      "As a dedicated freelancer, my goal is to partner with clients to transform their ideas into reality. I bring not only technical expertise but also a strong sense of ownership and a collaborative spirit to every project. I'm passionate about leveraging my skills in technologies like Go, Node.js, and React to deliver solutions that drive business growth and provide exceptional user experiences."
    ],
    "services": {
      "title": "What I'm Doing",
      "items": [
        {
          "icon": "/assets/images/about/web.png",
          "title": "Full-Stack Solutions",
          "text": "Providing end-to-end development services for web applications. I handle everything from server-side logic and database architecture to client-side implementation, ensuring a seamless and integrated final product."
        },
        {
          "icon": "/assets/images/about/desktop.png",
          "title": "Backend & API Development",
          "text": "Crafting high-performance, scalable, and secure APIs using Go, Node.js (NestJS, Express). Specializing in both RESTful and GraphQL architectures to power your applications."
        },
        {
          "icon": "/assets/images/about/console.png",
          "title": "Frontend Development",
          "text": "Building beautiful, responsive, and interactive user interfaces with modern frameworks like React, Next.js, and Vue.js. Focused on performance and user experience."
        },
        {
          "icon": "/assets/images/about/photoshop.png",
          "title": "Database & DevOps",
          "text": "Designing efficient database schemas for PostgreSQL, MySQL, and MongoDB. Implementing CI/CD pipelines and managing deployments with Docker and AWS for reliable and scalable infrastructure."
        }
      ]
    },
    "testimonials": {
      "title": "Testimonials",
      "items": [
        {
          "id": 1,
          "name": "Onur Dikyar",
          "title": "Senior Application Developer at PXL Digital Solutions",
          "avatar": "/assets/images/testimonials/avatar-11.png",
          "text": "<p>Despite his impressive technological knowledge, Furkan's most important characteristic is his flexible intelligence, personal discipline and reliability, rather than his programming skills. <br /><br />He is a problem solver and a fixer. <br /><br />From the very first meeting, you realize that you don't need to constantly check the work you have assigned to him/her.</p>"
        },
        {
          "id": 2,
          "name": "Sungur Taş",
          "title": ".NET Developer at PXL Digital Solutions",
          "avatar": "/assets/images/testimonials/avatar-10.png",
          "text": "<p>Furkan is a self-sacrificing and hard-working person who loves to work and has adopted the principle of working flawlessly in the projects he is responsible for. I worked in the same team with him on different projects, and he was a teammate who was keen on research and self-development.</p>"
        },
        {
          "id": 3,
          "name": "Tahir Uzelli",
          "title": "Mobile Developer at PXL Digital Solutions",
          "avatar": "/assets/images/testimonials/avatar-9.png",
          "text": "<p>During the periods we worked together with Furkan, the fact that he completed the tasks quickly and in a quality manner is the biggest indicator of his analytical intelligence and talent. someone I would always want to work with.</p>"
        },
        {
          "id": 4,
          "name": "Muhammed Ceylan",
          "title": "Software Engineer at PXL Digital Solutions",
          "avatar": "/assets/images/testimonials/avatar-8.png",
          "text": "<p>Furkan and I developed projects together in the same team. We did good work together with his fast problem solving, algorithmic thinking and discipline at the same time. <br /><br />He is also a very good team player and has always been a good teammate with his approach and sincere attitude.</p>"
        },
        {
          "id": 5,
          "name": "Fulya Er",
          "title": "Senior .Net Developer at PXL Digital Solutions",
          "avatar": "/assets/images/testimonials/avatar-7.png",
          "text": "<p>Obviously, even though we've only been working for a short time; <br /><br />Your ability to learn quickly and your enthusiasm for your work made a very positive impression. Since you started working, you have been able to quickly grasp the tasks I have given you and interpret them for yourself. At the same time, the fact that you do not hesitate to ask questions when you encounter difficulties contributes significantly to the work. <br /><br />*Ability to learn quickly and adapt to new technologies. <br />*Ability to complete assigned tasks in a timely and accurate manner. <br />*Ability to research and propose your own solutions. <br />*Willingness to ask for help and cooperate when you get stuck. <br /><br />I can say that you are successful in these matters. Of course, you have a long way to go, but I think you will develop your skills even more by taking more responsibility in projects in the future 🙂</p>"
        },
        {
          "id": 6,
          "name": "Erdal Parmaksız",
          "title": "Software Manager at Ofmark",
          "avatar": "/assets/images/testimonials/avatar-6.png",
          "text": "<p>During the period we worked together, it was a great pleasure to work with Furkan, especially his work discipline, ability to interpret events, ability to solve problems, practical intelligence. Even though we parted ways in this project, he is a friend that I would like to be in the same team in the future and that I can be a reference in every sense.</p>"
        }
      ]
    },
    "_clients": {
      "title": "Clients",
      "items": [
        { "logo": "/assets/images/clients/kiraz-oto.png", "alt": "Kiraz Oto" },
        { "logo": "/assets/images/clients/futs-medya.png", "alt": "Futs Medya" },
        { "logo": "/assets/images/clients/olivia.jpg", "alt": "Olivia" }
      ]
    }
  },
  "resume": {
    "title": "Resume",
    "education": {
      "title": "Education",
      "items": [
        {
          "title": "Bachelor of Engineering - BE, Information Technology",
          "date": "Apr 2020 - May 2023",
          "description": "Gujarat Technological University (GTU)"
        },
        {
          "title": "Diploma of Engineering - DE, Information Technology",
          "date": "Jun 2016 - Jul 2019",
          "description": "Gujarat Technological University (GTU)"
        }
      ]
    },
    "experience": {
      "title": "Experience",
      "items": [
        {
          "title": "Freelance Full Stack Developer",
          "date": "2021 — Present",
          "description": [
            "Successfully delivered a variety of projects for clients worldwide.",
            "Specialized in building custom web applications, e-commerce solutions, and APIs.",
            "Responsible for the full project lifecycle, from requirement gathering to deployment and maintenance."
          ]
        },
        {
          "title": "Senior Software Engineer at Albiorix Technology",
          "date": "Apr 2022 — Present",
          "description": [
            "Worked with cross-functional teams to design, develop, and implement web applications using Next.js, React.js, Vue.js, PHP, Node.js, Go, and more.",
            "Assisted in project planning, including estimating timelines and identifying project risks.",
            "Collaborated and communicated with the client's team for task planning."
          ]
        },
        {
          "title": "Software Engineer at VHM Infotech",
          "date": "Oct 2019 — Apr 2022",
          "description": [
            "Designed and implemented websites from start to finish using Node.js, React Native, PHP, WordPress, and Laravel.",
            "Developed and structured feature-rich client websites and applications.",
            "Analyzed client requirements to determine the feasibility of projects."
          ]
        },
        {
          "title": "Android Developer Trainee at Orion Computech",
          "date": "Jul 2018 — Jun 2019",
          "description": [
            "Gained hands-on experience in Android development during a year-long internship."
          ]
        }
      ]
    },
    "skills": {
      "title": "My Skills",
      "items": [
        {
          "category": "Languages & Databases",
          "values": ["Go", "JavaScript (ES6+)", "TypeScript", "PHP", "SQL", "PostgreSQL", "MySQL", "MongoDB", "Redis"]
        },
        {
          "category": "Frameworks & Libraries",
          "values": ["Node.js", "NestJS", "Express.js", "React", "Next.js", "Vue.js", "Laravel", "Tailwind CSS"]
        },
        {
          "category": "Tools & Platforms",
          "values": ["Docker", "AWS", "GraphQL", "REST APIs", "Git", "CI/CD"]
        }
      ]
    },
    "certificates": {
      "title": "Licenses & Certifications",
      "items": [
        {
          "title": "Complete NodeJS Developer (GraphQL, MongoDB, + more)",
          "link": "https://www.udemy.com/certificate/UC-c21d7936-6550-466b-816a-54d065758203/"
        },
        {
          "title": "Agile Metrics for Agile Project Management",
          "link": "https://www.udemy.com/certificate/UC-1c0cff60-3e95-41fb-aa72-63e8a049b951/"
        }
      ]
    }
  },
  "portfolio": {
    "title": "Portfolio",
    "filters": ["All", "Full-Stack", "Backend", "Frontend"],
    "projects": [
      {
        "id": 1,
        "title": "Enterprise E-commerce Platform",
        "category": "Full-Stack",
        "image": "/assets/images/portfolio/portfolio-1.jpg",
        "link": "#",
        "description": "Architected and built a feature-rich, multi-vendor e-commerce platform from scratch. The system includes complex inventory management, a secure payment gateway integration (Stripe), and a comprehensive admin dashboard for managing products, orders, and users. The backend is powered by a resilient Go microservices architecture, with a React/Next.js frontend for a lightning-fast user experience."
      },
      {
        "id": 2,
        "title": "Real-time Analytics API",
        "category": "Backend",
        "image": "/assets/images/portfolio/portfolio-2.jpg",
        "link": "#",
        "description": "Developed a high-throughput GraphQL API for a real-time data analytics dashboard. Built with Node.js and NestJS, it processes and aggregates millions of data points daily from various sources. Utilized PostgreSQL for structured data and Redis for caching to ensure sub-second response times. Deployed on AWS with Docker for scalability and reliability."
      },
      {
        "id": 3,
        "title": "SaaS Project Management Tool",
        "category": "Frontend",
        "image": "/assets/images/portfolio/portfolio-3.jpg",
        "link": "#",
        "description": "Led the frontend development for a collaborative project management SaaS application. Using Vue.js and Pinia, I created a highly interactive and intuitive user interface with features like drag-and-drop task boards, real-time notifications via WebSockets, and dynamic charting. Focused on component-based architecture for maintainability and scalability."
      }
    ]
  },
  "navigation": [
    { "name": "About", "page": "about" },
    { "name": "Resume", "page": "resume" },
    { "name": "Portfolio", "page": "portfolio" }
  ]
} 